In [1]:
import numpy as np
import pandas as pd
import requests
from sklearn.impute import SimpleImputer

In [2]:
url = 'https://data.cityofchicago.org/resource/n4bx-5kf6.json'

In [3]:
#make get request for city of chicago salary data
r = requests.get(url)

In [4]:
#check response is 200
r

In [5]:
#save json content to json save to dataframe
json = r.json()

In [6]:
salary_df = pd.DataFrame(json)

In [7]:
salary_df.head()

,name,job_titles,department,full_or_part_time,salary_or_hourly,annual_salary,frequency_description,hourly_rate
0,"AARON, JEFFERY M",LIEUTENANT,DEPARTMENT OF POLICE,F,SALARY,141552,NaN,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),DEPARTMENT OF POLICE,F,SALARY,113568,NaN,NaN
2,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,DEPT OF WATER MANAGEMENT,F,SALARY,129540,NaN,NaN
3,"ABARCA-COMPTON, RUTH A",ATTORNEY,DEPARTMENT OF PUBLIC HEALTH,F,SALARY,117816,NaN,NaN
4,"ABARCA, EMMANUEL",CONCRETE LABORER,CHICAGO DEPT OF TRANSPORTATION,F,HOURLY,NaN,40,48.9

In [8]:
salary_df.isna().sum()

name                       0
job_titles                 0
department                 0
full_or_part_time          0
salary_or_hourly           0
annual_salary            175
frequency_description    825
hourly_rate              825
dtype: int64

In [9]:
salary_df_numeric_cols = ['annual_salary', 'frequency_description','hourly_rate']

In [10]:
salary_df[salary_df_numeric_cols] = salary_df[salary_df_numeric_cols].apply(pd.to_numeric, errors='coerce')
salary_df.dtypes

name                      object
job_titles                object
department                object
full_or_part_time         object
salary_or_hourly          object
annual_salary            float64
frequency_description    float64
hourly_rate              float64
dtype: object

In [11]:
#hourly workers only
hrly_salary_df = salary_df[salary_df["salary_or_hourly"]=="HOURLY"].copy()
#salaried workers only
annual_salary_df = salary_df[salary_df["salary_or_hourly"]=="SALARY"].copy()

In [13]:
#check for "F" workers with "HOURLY" pay and annualized 52 weeks of pay for 40hr work weeks
hrly_salary_df["annual_salary"]=[float(x) for x in (hrly_salary_df["hourly_rate"]*hrly_salary_df["frequency_description"]*52)]

In [14]:
hrly_salary_df[hrly_salary_df["annual_salary"]==hrly_salary_df["annual_salary"].min()]

,name,job_titles,department,full_or_part_time,salary_or_hourly,annual_salary,frequency_description,hourly_rate
207,"AGUAYO, REY D",CUSTODIAL WORKER,DEPARTMENT OF AVIATION,F,HOURLY,34736.0,40.0,16.7
208,"AGUAYO, ROMEO D",CUSTODIAL WORKER,DEPARTMENT OF AVIATION,F,HOURLY,34736.0,40.0,16.7

In [15]:
hrly_salary_df[hrly_salary_df["annual_salary"]==hrly_salary_df["annual_salary"].max()]

,name,job_titles,department,full_or_part_time,salary_or_hourly,annual_salary,frequency_description,hourly_rate
667,"AMEDIO, ANTHONY",ASST CHIEF OPERATING ENGINEER,DEPT OF WATER MANAGEMENT,F,HOURLY,136364.8,40.0,65.56
773,"ANDERSON, TARIQ A",ASST CHIEF OPERATING ENGINEER,DEPT OF WATER MANAGEMENT,F,HOURLY,136364.8,40.0,65.56
988,"ARREDONDO, GABRIEL",ASST CHIEF OPERATING ENGINEER,DEPT OF WATER MANAGEMENT,F,HOURLY,136364.8,40.0,65.56

In [16]:
annual_salary_df[annual_salary_df["annual_salary"]==annual_salary_df["annual_salary"].min()]

,name,job_titles,department,full_or_part_time,salary_or_hourly,annual_salary,frequency_description,hourly_rate
168,"ADELMAN, BRUCE E",LEGISLATIVE AIDE,CITY COUNCIL,F,SALARY,22920.0,NaN,NaN

In [17]:
annual_salary_df[annual_salary_df["annual_salary"]==annual_salary_df["annual_salary"].max()]

,name,job_titles,department,full_or_part_time,salary_or_hourly,annual_salary,frequency_description,hourly_rate
94,"ACHILLES, AMBER L",MANAGING DEPUTY COMMISSIONER,DEPARTMENT OF AVIATION,F,SALARY,190044.0,NaN,NaN